def task_1_case():
    dict1 = {
        1: "понеділок",
        2: "вівторок",
        3: "середа",
        4: "четвер",
        5: "п'ятниця",
        6: "субота",
        7: "неділля"
    }
    x = 6
    print("День тижня = {0}".format(dict[x]))


def task_4_case():
    x = "31"
    y = "30"
    z = "28"
    dict1 = {
        1: x,
        2: z,
        3: x,
        4: y,
        5: x,
        6: y,
        7: x,
        8: x,
        9: y,
        10: x,
        11: y,
        12: x
    }
    a = 3
    print(dict1[a])